templates_servicios/ambiente_test/SOAP_CPLT_PortalTransparencia_input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xd="http://www.w3.org/2000/09/xmldsig#">   	
   <soapenv:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-1">
            <wsse:Username>SGS-PdT</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">RogN0dN_b8</wsse:Password>
            <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">pE1SjWa6xuWYgQz0Rkvpsg==</wsse:Nonce>
            <wsu:Created>2013-11-21T15:07:39.796Z</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>   
	<soapenv:Body>		
		<sobre xmlns="http://valida.aem.gob.cl">
         <encabezado>
            <idSobre>ELPISEE.inputParameter.headerParameters['id_sobre']</idSobre>			
            <fechaHora>ELPISEE.inputParameter.headerParameters['fecha_hora']</fechaHora>
            <proveedor>
               <nombre>ELPISEE.inputParameter.headerParameters['nombre_proveedor']</nombre>
               <servicios>
                  <servicio>ELPISEE.inputParameter.headerParameters['nombre_servicio']</servicio>
                  <respuestaServicio>
                     <estado>SI</estado>
                     <glosa>RESPUESTA EXITOSA</glosa>
                  </respuestaServicio>
               </servicios>
            </proveedor>
            <consumidor>               
			   <nombre>ELPISEE.inputParameter.headerParameters['nombre_consumidor']</nombre>
               <tramite>ELPISEE.inputParameter.headerParameters['nombre_tramite']</tramite>
				<certificado>
                  <xd:X509Data>
                     <xd:X509IssuerSerial>
                        <xd:X509IssuerName></xd:X509IssuerName>
                        <xd:X509SerialNumber>0</xd:X509SerialNumber>
                     </xd:X509IssuerSerial>
                  </xd:X509Data>
               </certificado>
            </consumidor>
            <fechaHoraReq>ELPISEE.inputParameter.headerParameters['fecha_hora_req']</fechaHoraReq>
            <emisor>ELPISEE.inputParameter.headerParameters['nombre_consumidor']</emisor>
            <metadataOperacional>
               <estadoSobre>00</estadoSobre>
               <glosaSobre>REST</glosaSobre>
            </metadataOperacional>
         </encabezado>		
			<cuerpo>
				<documento>
					<TransparenciaEventoInteroperacionSAI>
						<AltaSaiOrganismo>
							<IdOrganismo>
								<CodOrganismo>ELPISEE.inputParameter.bodyParameters['p01']</CodOrganismo>
								<DescOrganismo>ELPISEE.inputParameter.bodyParameters['p02']</DescOrganismo>
								<Estado>ELPISEE.inputParameter.bodyParameters['p03']</Estado>
								<PadreOrganismo>ELPISEE.inputParameter.bodyParameters['p04']</PadreOrganismo>
							</IdOrganismo>
							<FormularioSolicitud>
								<NumSolicitud>ELPISEE.inputParameter.bodyParameters['p05']</NumSolicitud>
								<FechaSolicitud>ELPISEE.inputParameter.bodyParameters['p06']</FechaSolicitud>							
								<Solicitante>
									<nombres>ELPISEE.inputParameter.bodyParameters['p07']</nombres>
									<apellidoPaterno>ELPISEE.inputParameter.bodyParameters['p08']</apellidoPaterno>
									<apellidoMaterno>ELPISEE.inputParameter.bodyParameters['p09']</apellidoMaterno>
								</Solicitante>
								<RazonSocial>ELPISEE.inputParameter.bodyParameters['p10']</RazonSocial>
								<Apoderado>
									<nombres>ELPISEE.inputParameter.bodyParameters['p11']</nombres>
									<apellidoPaterno>ELPISEE.inputParameter.bodyParameters['p12']</apellidoPaterno>
									<apellidoMaterno>ELPISEE.inputParameter.bodyParameters['p13']</apellidoMaterno>
								</Apoderado>
								<Email>ELPISEE.inputParameter.bodyParameters['p14']</Email>
								<DireccionPostal>
									<Nombre>ELPISEE.inputParameter.bodyParameters['p15']</Nombre>
									<Numero>ELPISEE.inputParameter.bodyParameters['p16']</Numero>
									<NumeroDepartamentoCasa>ELPISEE.inputParameter.bodyParameters['p17']</NumeroDepartamentoCasa>
									<NumeroTorre>ELPISEE.inputParameter.bodyParameters['p18']</NumeroTorre> 
									<Comuna>
										<CodigoComuna>ELPISEE.inputParameter.bodyParameters['p19']</CodigoComuna>
										<DescripcionComuna>ELPISEE.inputParameter.bodyParameters['p20']</DescripcionComuna>
									</Comuna>
									<Provincia>
										<CodigoProvincia>ELPISEE.inputParameter.bodyParameters['p21']</CodigoProvincia>
										<DescripcionProvincia>ELPISEE.inputParameter.bodyParameters['p22']</DescripcionProvincia>
									</Provincia>
									<Ciudad>ELPISEE.inputParameter.bodyParameters['p23']</Ciudad>
									<Region>
										<CodigoRegion>ELPISEE.inputParameter.bodyParameters['p24']</CodigoRegion>
										<DescripcionRegion>ELPISEE.inputParameter.bodyParameters['p25']</DescripcionRegion>
									</Region>
									<Pais>ELPISEE.inputParameter.bodyParameters['p26']</Pais>
									<CodigoPostal>ELPISEE.inputParameter.bodyParameters['p27']</CodigoPostal>
									<Tipo>ELPISEE.inputParameter.bodyParameters['p28']</Tipo>
									<InformacionAdicional>ELPISEE.inputParameter.bodyParameters['p29']</InformacionAdicional>
								</DireccionPostal>
								<TextoSolicitud>ELPISEE.inputParameter.bodyParameters['p30']</TextoSolicitud>
								<Observaciones>ELPISEE.inputParameter.bodyParameters['p31']</Observaciones>
								<IdFormaRecepcion>ELPISEE.inputParameter.bodyParameters['p32']</IdFormaRecepcion>
								<EmailRecepcion>ELPISEE.inputParameter.bodyParameters['p33']</EmailRecepcion>
								<DireccionPostalRecepcion>
									<Nombre>ELPISEE.inputParameter.bodyParameters['p34']</Nombre>
									<Numero>ELPISEE.inputParameter.bodyParameters['p35']</Numero>
									<NumeroDepartamentoCasa>ELPISEE.inputParameter.bodyParameters['p36']</NumeroDepartamentoCasa>
									<NumeroTorre>ELPISEE.inputParameter.bodyParameters['p37']</NumeroTorre> 
									<Comuna>
										<CodigoComuna>ELPISEE.inputParameter.bodyParameters['p38']</CodigoComuna>
										<DescripcionComuna>ELPISEE.inputParameter.bodyParameters['p39']</DescripcionComuna>
									</Comuna>
									<Provincia>
										<CodigoProvincia>ELPISEE.inputParameter.bodyParameters['p40']</CodigoProvincia>
										<DescripcionProvincia>ELPISEE.inputParameter.bodyParameters['p41']</DescripcionProvincia>
									</Provincia>
									<Ciudad>ELPISEE.inputParameter.bodyParameters['p42']</Ciudad>
									<Region>
										<CodigoRegion>ELPISEE.inputParameter.bodyParameters['p43']</CodigoRegion>
										<DescripcionRegion>ELPISEE.inputParameter.bodyParameters['p44']</DescripcionRegion>
									</Region>
									<Pais>ELPISEE.inputParameter.bodyParameters['p45']</Pais>
									<CodigoPostal>ELPISEE.inputParameter.bodyParameters['p46']</CodigoPostal>
									<Tipo>ELPISEE.inputParameter.bodyParameters['p47']</Tipo>
									<InformacionAdicional>ELPISEE.inputParameter.bodyParameters['p48']</InformacionAdicional>
								</DireccionPostalRecepcion>
							</FormularioSolicitud>
							<IdOficinaRecogida>ELPISEE.inputParameter.bodyParameters['p49']</IdOficinaRecogida>
							<IdFormaEntrega>ELPISEE.inputParameter.bodyParameters['p50']</IdFormaEntrega>
							<ObservacionesFormaEntrega>ELPISEE.inputParameter.bodyParameters['p51']</ObservacionesFormaEntrega>
							<OtraInformacionSai SchemaVersion="1.0">
								<Cantidad>0</Cantidad>
								<ArchivoBinario SchemaVersion="1.0">
									<Nombre/>
									<TipoContenido/>
									<CantidadBytes/>
									<DataCodificada/>
									<Descripcion/>
								</ArchivoBinario>
							</OtraInformacionSai>
						</AltaSaiOrganismo>
					</TransparenciaEventoInteroperacionSAI>
				</documento>
			</cuerpo>
		</sobre>
	</soapenv:Body>
</soapenv:Envelope>
